#Это просто тренеровался
'''
#вывод нескольких переменных списком
print([1, 10])

#вывод нескольких переменных списком с пустым разделителем
c = "1 2"
print(c.split())
'''
#Это практическая
#Уровень A. Вывести на экран фразу лесенкой:
print("Вася \n    пошёл \n\t гулять.")

#Уровень B. Вывести на экран изображение домика из букв:
print("   A \n  AMA \n AMMMA \nAMMMMMA \n MMMMM \n ЖЖ ЖЖ \n MMMMM ")

#Уровень C. Вывести на экран изображение двух домиков:
print("   A       А\n  AMA     AMA\n AMMMA   AMMMA\nAMMMMMA AMMMMMA\n MMMMM   MMMMM\n ЖЖ ЖЖ   ЖЖ ЖЖ\n MMMMM   MMMMM")
