#№6

#6.	Не используя значение Пи, с помощью метода Монте-Карло вычислите 
#объёмы шаров раз-личного диаметра:

import random

pi = 3.141828# при N = 100000000

N = 1000000
M = 0

for i in range(N):
    x = random.random()
    y = random.random()
    if x*x+y*y <= 1:
        M += 1

Pi = 4*M/N

print("PI =", pi)


R = 5

V = 4/3 * pi * (R*R*R)

print("V =", V)

#при R = 1; V = 4.1891039999999995
#при R = 2; V = 33.512831999999996
#при R = 3; V = 113.10580799999998
#при R = 4; V = 268.10265599999997
#при R = 5; V = 523.6379999999999
